"""
存放crm中一些常用的数据，变量使用表名


"""


class CrmTools:
    # 正式环境和alpha环境的登录信息
    bbp_user_info_official = {"username": "AbHrk9AYDekBlJCVSFb2ag==", "password": "HsoObGzkwfdwffjX+ykjPA==",
                              "platformCode": "0004"}
    # 测试环境的登录信息，用于日常环境登录和操作，crmtestadmin
    bbp_user_info = {"username": "+CYQ0v7PAfWjeQv9RDUZQg==", "password": "8x5rTYjUtRk=",
                     "platformCode": "0004"}
    # 测试环境的admin账号登录信息，备用
    bbp_admin_info = {"username": "WJ2tod/VMtdwffjX+ykjPA==", "password": "GXuFOM+isDtc4Mcv8AVaPA==",
                      "platformCode": "0004"}
    bbp_header = {'User-Agent': "Chrome/89.0.4389.72", 'Content-Type': 'application/json', "charset": "UTF-8",
                  "authorization": 'dd34e0ff4e10a1d3b9428589369138e0', 'token': None}

    # 科目数据
    crm_subject = {"英语": 10, "前途美中": 20, "磨课": 30, "数学": 50, "语文": 40, "不区分": 60, "语言素养": 70, "中文": 80}

    #  课程类型数据
    crm_course_type = {'主课1V3': 10,
                       '试听': 20, '大班直播课': 30, '自然拼读课': 60, '补课': 70, '技术服务': 40, '中教课': 80, '定制课': 90,
                       '文化课': 92, '测试': 65, '小班课': 95, 'AI课': 12, '口语课': 11, '中学个性课': 13, '中学大班课': 14,
                       '外教培训课': 91, '藤校国际班': 97, '预替课': 93, '中文1V1试听': 98, '中文主修1V1': 99}

    crm_term = {'春': 10, '暑': 20, '秋': 30, '寒': 40, '春上': 11, '春下': 12, '秋上': 31, '秋下': 32}

    coursetype6 = ['主课1V3', '藤校国际班', '小班课', '定制课']  # 学季配置为六季的课程类型
    coursetype4 = ['自然拼读课', '文化课', '口语课']  # 学季配置为四季的课程类型
    termlist6 = ['暑', '秋上', '秋下', '寒', '春上', '春下']
    termlist4 = ['暑', '秋', '寒', '春']

    # 课程渠道，班级渠道，不适用于订单渠道，注：订单渠道中测试渠道编码为78,东莞学校，南阳学校重复，已经去重
    crm_course_channel = {"内部": 10, "北京学校": 20, "济南学校": 21, "鱼塘": 30, "杭州学校": 22, "成都学校": 23, "备用学校": 24, "新疆学校": 25,
                          "天津学校": 26, "广州学校": 27, "南京学校": 28, "深圳学校": 29, "苏州学校": 31, "微信分销": 40, "武汉学校": 32,
                          "青岛学校": 33,
                          "排课临时渠道": 34, "斯林姆": 41, "合肥学校": 35, "长沙学校": 36, "湘潭学校": 37, "株洲学校": 38, "郑州学校": 39,
                          "前途美中": 42,
                          "无锡学校": 43, "虚拟班": 44, "新直播灰度测试": 45, "兰州学校": 46, "福州学校": 47, "乌鲁木齐学校": 48, "太原学校": 49,
                          "南昌学校": 50, "盐城学校": 51, "上海学校": 52, "西安学校": 53, "连云港学校": 54, "厦门学校": 55, "迈格森": 56,
                          "外教培训课": 90,
                          "贵阳学校": 57, "国外": 59, "呼和浩特学校": 58, "富阳学校": 60, "金华学校": 61, "义乌学校": 62, "娄底学校": 63, "优能": 64,
                          "焦作学校": 65, "烟台学校": 66, "双师": 67, "温州学校": 68, "南宁学校": 69, "锦州学校": 70, "葫芦岛学校": 71, "徐州学校": 72,
                          "余杭学校": 73, "宁波学校": 74, "测试渠道": 75, "洛阳学校": 76, "小班课": 77, "AI公益课": 78, "镇江学校": 79,
                          "AI课程-分校渠道": 80, "重庆学校": 81, "襄阳学校": 82, "云南学校": 83, "优能外教1对1": 84, "佛山学校": 85, "海口学校": 86,
                          "豌豆扩科": 87, "市场推广": 88, "新东方AI课": 89, "长春学校": 91, "哈尔滨学校": 92, "沈阳学校": 93, "荆州学校": 94,
                          "泰州学校": 95,
                          "西宁学校": 96, "大连学校": 97, "唐山学校": 98, "绍兴学校": 99, "宜昌学校": 100, "扬州学校": 101, "珠海学校": 102,
                          "十堰学校": 104, "潍坊学校": 105, "黄石学校": 106, "南通学校": 107, "保定学校": 108, "汉语拼音": 109,
                          "芜湖学校": 110, "中山学校": 111, "东莞学校": 113, "开封学校": 114, "石家庄学校": 115, "吉林学校": 116,
                          "绵阳学校": 117, "银川学校": 118, "待用学校": 119, "惠州学校": 120, "嘉兴学校": 121, "鞍山学校": 122, "包头学校": 123,
                          "南阳学校": 124, "台州学校": 125, "廊坊学校": 126, "市场运营": 127, "重庆永州区新东方学校": 141, "泉州学校": 128}

    crm_course_level = {"L1": 10, "L2": 20, "L3": 30, "L4": 40, "L Pre": 99, "L5": 50, "L6": 60, "L Pre1": 98,
                        "L Pre2": 97, "L Pre3": 96, "L Pre4": 95}

# if __name__ == "__main__":
#     setattr(CrmTools, "bbp_token", 'dasdas')
#     print(CrmTools.bbp_token)
#     print(CrmTools.bbp_header)
